'''import random
i = random.randint(1,10)
t = 0
while True:
    t = int(input('Угадай число от 1 до 10: '))
    if i==t:
        print("Молодец")
    elif t<i:
        print("Чуть меньше задуманного.")
    elif t>i:
        print("Чуть больше задуманного.")
    else:print(f"Сильно промохнулся на {i-t}, попытки кончились.")'''
'''#_________________________Task2___________________________________

i=int(input('Введите положительное число: '))
while i<=0:
    i = int(input('Введите положительное число: '))
print(i)'''
'''# _________________________Task 3___________________________________
x=0
while True:
    c=input("Введите число (или 'quit' для завершения): ")
    if c=='quit':
        break
    x+=int(c)
print(x)'''
# _________________________Task 4___________________________________

numbers = []
i = 0
while i<=10:
    q = input("Введите число простое число: ")
    q = int(q)
    if ((q**(q-1)-1)/q)!=0:
        numbers.append(int(q))
        i+=1
print(numbers)
