# # Среднее значение элементов списка
# my_list=[1,2,3,4,5,6,7,8,9]
# print(sum(my_list)/len(my_list))
# Задание 2
my_list=[]
# my_list.split: int(input())

# print(sum(my_list))
print(my_list)
# # ------------------------------------------------
# numbers = []
# while True:
#     us_input = input("Введите число (или 'стоп' для завершения): ")
#     if us_input == "стоп":
#         break
#     numbers.append(int(us_input))

# if numbers:
#     print("Минимальное значение: ",min(numbers))
#     print("Максимальное значение: ",max(numbers))
# else:
#     print("Список пуст.")